linklayer/BLEKey/nordic/nrf51822/Board/nrf6310/s110/ble_app_cscs/main.c
#define SEC_PARAM_TIMEOUT                    30                                         /**< Timeout for Pairing Request or Security Request (in seconds). */
#define SEC_PARAM_BOND                       1                                          /**< Perform bonding. */
#define SEC_PARAM_MITM                       0                                          /**< Man In The Middle protection not required. */
#define SEC_PARAM_IO_CAPABILITIES            BLE_GAP_IO_CAPS_NONE                       /**< No I/O capabilities. */
#define SEC_PARAM_OOB                        0                                          /**< Out Of Band data not available. */
#define SEC_PARAM_MIN_KEY_SIZE               7                                          /**< Minimum encryption key size. */
#define SEC_PARAM_MAX_KEY_SIZE               16                                         /**< Maximum encryption key size. */

#define DEAD_BEEF                            0xDEADBEEF                                 /**< Value used as error code on stack dump, can be used to identify stack location on stack unwind. */


static uint16_t                              m_conn_handle = BLE_CONN_HANDLE_INVALID;   /**< Handle of the current connection. */
static ble_gap_adv_params_t                  m_adv_params;                              /**< Parameters to be passed to the stack when starting advertising. */
static ble_bas_t                             m_bas;                                     /**< Structure used to identify the battery service. */
static ble_cscs_t                            m_cscs;                                    /**< Structure used to identify the cycling speed and cadence service. */

static ble_sensorsim_cfg_t                   m_battery_sim_cfg;                         /**< Battery Level sensor simulator configuration. */
static ble_sensorsim_state_t                 m_battery_sim_state;                       /**< Battery Level sensor simulator state. */

static ble_sensorsim_cfg_t                   m_speed_kph_sim_cfg;                       /**< Speed simulator configuration. */
static ble_sensorsim_state_t                 m_speed_kph_sim_state;                     /**< Speed simulator state. */
static ble_sensorsim_cfg_t                   m_crank_rpm_sim_cfg;                       /**< Crank simulator configuration. */
static ble_sensorsim_state_t                 m_crank_rpm_sim_state;                     /**< Crank simulator state. */

static app_timer_id_t                        m_battery_timer_id;                        /**< Battery timer. */
static app_timer_id_t                        m_csc_meas_timer_id;                       /**< CSC measurement timer. */
static dm_application_instance_t             m_app_handle;                              /**< Application identifier allocated by device manager. */
static uint32_t                              m_cumulative_wheel_revs;                   /**< Cumulative wheel revolutions. */
static bool                                  m_auto_calibration_in_progress;            /**< Set when an autocalibration is in progress. */

static bool                                  m_memory_access_in_progress = false;       /**< Flag to keep track of ongoing operations on persistent memory. */

static ble_sensor_location_t                 supported_locations[] = {                  /**< supported location for the sensor location. */
                                                  BLE_SENSOR_LOCATION_FRONT_WHEEL ,
                                                  BLE_SENSOR_LOCATION_LEFT_CRANK  ,
                                                  BLE_SENSOR_LOCATION_RIGHT_CRANK ,
                                                  BLE_SENSOR_LOCATION_LEFT_PEDAL  ,
                                                  BLE_SENSOR_LOCATION_RIGHT_PEDAL ,
                                                  BLE_SENSOR_LOCATION_FRONT_HUB   ,
                                                  BLE_SENSOR_LOCATION_REAR_DROPOUT,
                                                  BLE_SENSOR_LOCATION_CHAINSTAY   ,
                                                  BLE_SENSOR_LOCATION_REAR_WHEEL  ,
                                                  BLE_SENSOR_LOCATION_REAR_HUB    ,
                                                 };



/**@brief Function for error handling, which is called when an error has occurred.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of error.
 *
 * @param[in] error_code  Error code supplied to the handler.
 * @param[in] line_num    Line number where the handler is called.
 * @param[in] p_file_name Pointer to the file name.
 */
void app_error_handler(uint32_t error_code, uint32_t line_num, const uint8_t * p_file_name)
{
    nrf_gpio_pin_set(ASSERT_LED_PIN_NO);

    // This call can be used for debug purposes during application development.
    // @note CAUTION: Activating this code will write the stack to flash on an error.
    //                This function should NOT be used in a final product.
    //                It is intended STRICTLY for development/debugging purposes.
    //                The flash write will happen EVEN if the radio is active, thus interrupting
    //                any communication.
    //                Use with care. Uncomment the line below to use.
    // ble_debug_assert_handler(error_code, line_num, p_file_name);

    // On assert, the system can only recover with a reset.
    NVIC_SystemReset();
}


/**@brief Callback function for asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in]   line_num   Line number of the failing ASSERT call.
 * @param[in]   file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}


/**@brief Function for performing battery measurement and updating the Battery Level characteristic
 *        in Battery Service.
 */
static void battery_level_update(void)
{
    uint32_t err_code;
    uint8_t  battery_level;

